In [1]:
import pandas as pd
import numpy as np

from functions import *

In [2]:
url = "data/edat_lfs_9903__custom_12827842_linear.csv"
education = read_data(url)

In [3]:
pd.set_option('display.max_columns', None)
education = clean_columns(education)
column_names_education(education)

education = change_value(education)  #cambia los valores de sex
education = change_name_country_education(education)  #cambia los valores de geo
education = nulos(education)

education = drop_rows(education)

education.head()

       sex level_education    age  country  year  value_education
0  Females             ESO  15-29  Austria  2014             27.9
1  Females             ESO  15-29  Austria  2015             27.5
2  Females             ESO  15-29  Austria  2016             27.3
3  Females             ESO  15-29  Austria  2017             27.2
4  Females             ESO  15-29  Austria  2018             27.1

In [4]:
url2 = "data/yth_empl_090__custom_12832588_linear.csv"
unemployment = read_data(url2)

In [5]:
unemployment = clean_columns(unemployment)
column_names_unemployment(unemployment)

unemployment = change_value(unemployment)
unemployment = change_name_country_unemployment(unemployment)
unemployment = nulos(unemployment)

unemployment = drop_rows(unemployment)
unemployment.head()

       sex    age level_education  country  year  value_unemployment
0  Females  15-29             ESO  Austria  2014                15.7
1  Females  15-29             ESO  Austria  2015                15.3
2  Females  15-29             ESO  Austria  2016                17.1
3  Females  15-29             ESO  Austria  2017                16.8
4  Females  15-29             ESO  Austria  2018                13.4

In [6]:
unemployment.duplicated(subset=["sex", "level_education", "age", "country", "year"]).sum()

4416

In [7]:
unemployment = drop_duplicates(unemployment)

In [8]:
df_limpio = comb_merg(unemployment, education)
df_limpio

,sex,age,level_education,country,year,value_unemployment,value_education
0,Females,15-29,ESO,Austria,2014,15.7,27.9
1,Females,15-29,ESO,Austria,2015,15.3,27.5
2,Females,15-29,ESO,Austria,2016,17.1,27.3
3,Females,15-29,ESO,Austria,2017,16.8,27.2
4,Females,15-29,ESO,Austria,2018,13.4,27.1
...,...,...,...,...,...,...,...
4666,Total,15-29,UNIVERSIDAD,United Kingdom,2015,5.4,28.9
4667,Total,15-29,UNIVERSIDAD,United Kingdom,2016,5.0,29.3
4668,Total,15-29,UNIVERSIDAD,United Kingdom,2017,4.6,29.5
4669,Total,15-29,UNIVERSIDAD,United Kingdom,2018,4.4,30.4
4670,Total,15-29,UNIVERSIDAD,United Kingdom,2019,4.8,31.1

In [9]:
df_limpio = fill_nan(df_limpio)
df_limpio

,sex,age,level_education,country,year,value_unemployment,value_education
0,Females,15-29,ESO,Austria,2014,15.7,27.9
1,Females,15-29,ESO,Austria,2015,15.3,27.5
2,Females,15-29,ESO,Austria,2016,17.1,27.3
3,Females,15-29,ESO,Austria,2017,16.8,27.2
4,Females,15-29,ESO,Austria,2018,13.4,27.1
...,...,...,...,...,...,...,...
4666,Total,15-29,UNIVERSIDAD,United Kingdom,2015,5.4,28.9
4667,Total,15-29,UNIVERSIDAD,United Kingdom,2016,5.0,29.3
4668,Total,15-29,UNIVERSIDAD,United Kingdom,2017,4.6,29.5
4669,Total,15-29,UNIVERSIDAD,United Kingdom,2018,4.4,30.4
4670,Total,15-29,UNIVERSIDAD,United Kingdom,2019,4.8,31.1

In [10]:
df_limpio.isnull().sum()

sex                   0
age                   0
level_education       0
country               0
year                  0
value_unemployment    0
value_education       0
dtype: int64

In [11]:
create_csv(df_limpio)